<?php  
\q exit quit - команды выхода из mysql монитор в командной строке
mysql -uroot -ppass и интер - вход в mysql монитор в командной
mysql -uroot -p - вход можно сделать без афиширования пароля, тогда он его запросит и ввод в виду звездочек

SHOW DATABASES; - просмотр всех баз данных
USE имя_базы; - переключиться на использование БД
SELECT DATABASE(); - вернет базу, с которой работать будем
SHOW TABLES; показать таблицы БД
SET NAMES 'cp866'; смена кодировки при подключении
SHOW VARIABLES LIKE '%char%'; получение текущего значения параметра
\h дает список команд



?>